print("게임을 시작하지")
print("헤어진 여자친구에게...")
print("1. 연락을 한다.")
print("2. 연락을 안 한다.")

first_answer = input("> ")

if first_answer == "1":
    print("답장이 단답으로 온다.")
    print("1. 뭔가 서운하다.")
    print("2. 그냥 별로 상관없다.")

    reply = input("> ")

    if reply == "1":
        print("뭔가 바라는게 있군?")
        print("왜 그녀가 장문으로 잘 보내주길 바라는거지?")
        print("이미 남남인데?")
        print("1. 계속 듣는다.")
        print("2. 그만 듣는다.")

        next_advice = input("> ")

        if next_advice == "1":
            print("이미 헤어진건 이제 인정하잖아?")
            print("물론 만난 시기가 좀 있기때문에 바로 마음이 식거나 할 수는 없겠지")
            print("하지만 좀 더 생각해보자")
            print("너가 붙으면 붙을수록 떨어질거야...")
            print("그니까 연락을 할때는 살짝의 부탁만 하는거지, 그이상은 하지말고")
            print("친구사이에서 할 수 있을정도의 부탁까지만해.")
            print("물론 그전에 너를 필요로하게 만들긴해야지")
            print("너무 질척대진않지만 부탁은 가능한 이런 정도")
            print("그리고 그전에 니가 잘 알아야되는건")
            print("너 다시 만나고 싶은거야???")
            print("그럼 잘 생각해봐 이게 익숙함의 함정인지")
            print("정말 쟤여야 하는지...")
        else:
            print("넌 멋진놈이야.")
            print("진짜 더 간지가 날 수 있는 그런 놈이고")
            print("난 너를 믿어, 그리고 나를 믿어.")
            print("자랑스럽다 임마.")
    else:
        print("사실 진짜 별로잖아.")
        print("잘 보면 그렇게 예쁘지도 않아")
        print("광대도 크고 그냥 내가 보는 각도에서만 그렇게 보이는거지")
        print("가슴도 없고 엉덩이도 쳐졌어.")
        print("사람이 내면도 중요하지만 외형도 중요하지")
        print("더 좋은 사람 분명히 백만명 넘게 있다.")
        print("그니까 걱정마.")

else:
    print("잘했어 임마.")
    print("너에게 관심도 없는 그런 여자애게 더이상 뭔가를 기대할 필요는 없어")
    print("그냥 그저 안맞았던거야, 전혀 안맞는 여자였고")
    print("너에게 상처만줬어.")
    print("그냥 단지 친구일뿐이야.")

print("--------------------------------------")
print("하지만 나는 깨달은게 많고")
print("이 다음엔 더 좋은 여자를 만나겠지^^")
print("착하고 예쁘고 섹시한 글래머!!!!")
